export const Text = [
    {
        banner : 
        {
            bannerIntro : <span style={{"fontSize": "0.75em"}} ><div>வணக்கம், நான் <span style={{ "fontSize": "0.9em" }} >கிஷோர் பிரபு </span>&#46;<br/> வளரும் மென்பொருளாளர்<br/></div></span>,
            bannerIcan : <span style={{"fontSize": "0.75em"}} >முடிந்தவை</span>      
        }, 

        intro : 
        {
            I : "எல்லாவற்றிலும் கொஞ்சமும் கொஞ்சத்தில் எல்லாவற்றும்",
            I1 : <p>மனித சுவிஸ் ராணுவ கத்தி.<br/> மென்பொருள், விளையாட்டு, இயந்திரத்தில் விருப்பம்</p>,
            view : "வேலைகள்",
            honest : "பெருசா ஒண்ணும் இல்லை.",
            notnow : "இப்பொழுதிற்கு ஒன்றும் இல்லை."
        },

        homeContact : 
        {
            contactEasy : "சுலபமாக தொடர்பு கொள்க.",
            click : "இங்கே தொடுக."
        },

        whatIdo : 
        {
            really : "என்னால் முடிந்தவை?",
            webfe : "வலை முன்புறம்",
            webbe : "வலை பின்புறம்",
            gamedev : "விளையாட்டு வடிவமைப்பு",
            webfeEx : <div><p>HTML, CSS, JavaScript மூலமாக எழுத்துக்களை பார்வையாளர்களால் அணுகி பயன்படுத்தும் காட்சியாக மாற்றுவதே முன் வலை உருவாக்கம் ஆகும். இதை ஒரு பின்னால் நடப்பவற்றை மறைத்து பயனர் உபயோகத்திற்கு ஏதுவான திரையாக எண்ணிக்கொள்ள முடியும்.  </p><p> எனக்கு HTML, CSS, JavaScript and ReactJS ஆகியவை தெரியும். </p></div>,
            webbeEx : <div><p>பயனர்களுக்கு தெரியக்கூடாதவையான கடவுச்சொற்கள், தரவுதள கடவுச்சொற்கள், API திறவுகோல்களை பின் வலை உருவாக்கம் கொண்டிருக்கும். முன் வலை உருவாக்கத்தையும் பின் வலை உருவாக்கத்தையும் இந்த காரணங்களால் ஒன்று என கூற முடியாது. </p> <p> எனக்கு Node JS, NextJS and Spring (Java Framework) ஆகியவை தெரியும். </p></div>,
            gamedevEx : <div><p>கணினி விளையாட்டு உருவாக்கம் என்பது எனக்கு மிகவும் பிடித்தவைகளுள் ஒன்றாகும். இதில் நாம் என்ன குறியீடு செய்தோமோ அதை நம்மால் கண்கூடாக பார்க்கவியலும். கணினி விளையாட்டு உருவாக்கத்திற்கு கணிதத்திலும், குறியீட்டிலும், இயற்பியலிலும் நல்ல அனுபவமும் அறிவும் தேவை. </p> <p>எனக்கு PyGame, Love2D (Lua game development framework) and SFML (C++ framework) ஆகியவை தெரியும். </p></div>,
            techIknow : "தெரிந்த தொழில்நுட்பங்கள் / மொழிகள்",
            techrlang : "நுட்பம்",
            proficient : "புலமை",
            profiframe : "தெரிந்த கட்டமைப்பு"
        },
    },
    {
        contactDirect : <span>அஞ்சல் அனுப்புக 📮<br /> நேரடியாக.</span>,
        appreciate : "மின்னஞ்சல் அனுப்புவது வரவேற்கப் படுகிறது. நல்ல விமர்சனம் மற்றும் பாராட்டுகளை கேட்க எப்பொழுதும் தயார்.",
        youShare : "இந்த மின்னஞ்சலை அனுப்புவதன் மூலம், நீங்கள் என்னுடன் உங்கள் மின்னஞ்சலை பகிர்கின்றீர்.",
        send : "அனுப்புக",
        name : "பெயர்",
        email : "மின்னஞ்சல்",
        message : "செய்தி"
    },
    {
        relax : <span>மீண்டும் ஒரு வணக்கம்! <br /> வாங்க ☕ குடிக்கலாம். </span>,
        neverEasy : "எளிதாக என்னை பற்றி அறியலாம்",
        aboutMe : "நான் அனுபவம் இல்லாத மென்பொருளாளராக இருந்தாலும், எதையாவது செய்யாமல் இருந்ததில்லை. கணினி விளையாட்டு மற்றும் வலைபக்கம் செய்ய, விளையாட, புதிய மொழிகள் மற்றும் கலாச்சாரம் கற்க பிடிக்கும்.",
        myBot : <span> இங்கிருந்து என் எந்திரன் பார்த்துக்கொள்வார். இவருடன் உரையாட முடியும். <br /> துரதிஷ்டவசமாக, ஆனால் இவர் என்னை போல நன்றாக பேசமாட்டார்.</span>
    },
    {
       home : "முகப்பு",
       contact : "தொடர்பு",
       about : "பற்றி",
       language : "மொழி",
       tamil : "தமிழ்",
       japanese : "யப்பானியம்",
       english : "ஆங்கிலம்",
       chinese : "சீனம்",
       theme : "நிறமுறை",
       day : "காலை",
       noon : "பகல்",
       night : "இரவு"
    }
]

export default { Text }